zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K118_LQFP64-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_cfg_utils.py
 * for S32K118_LQFP64/signal_configuration.xml
 *
 * Copyright 2023, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K146_LQFP64-pinctrl.h with this part's differences applied
 * below (76 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 7d1b1be1e8f1c84f
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K118_LQFP64_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K118_LQFP64_WRAPPER_

#include "S32K146_LQFP64-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_SE8_PTB13
#undef ADC1_SE0_PTA2
#undef ADC1_SE10_PTE2
#undef ADC1_SE11_PTE6
#undef ADC1_SE14_PTB0
#undef ADC1_SE15_PTB1
#undef ADC1_SE1_PTA3
#undef ADC1_SE2_PTD2
#undef ADC1_SE3_PTD3
#undef ADC1_SE4_PTC6
#undef ADC1_SE5_PTC7
#undef ADC1_SE6_PTD4
#undef ADC1_SE7_PTB12
#undef ADC1_SE8_PTB13
#undef CAN1_RX_PTA12
#undef CAN1_RX_PTC6
#undef CAN1_TX_PTA13
#undef CAN1_TX_PTC7
#undef CAN2_RX_PTB12
#undef CAN2_RX_PTC16
#undef CAN2_TX_PTB13
#undef CAN2_TX_PTC17
#undef EWM_IN_PTA3
#undef EWM_IN_PTC4
#undef EWM_IN_PTE5
#undef EWM_OUT_b_PTA2
#undef EWM_OUT_b_PTA4
#undef EWM_OUT_b_PTE4
#undef FTM2_CH0_PTC5
#undef FTM2_CH0_PTD0
#undef FTM2_CH1_PTA0
#undef FTM2_CH1_PTD1
#undef FTM2_CH2_PTE4
#undef FTM2_CH3_PTD5
#undef FTM2_CH3_PTE5
#undef FTM2_CH4_PTE10
#undef FTM2_CH5_PTE11
#undef FTM2_FLT0_PTE3
#undef FTM2_FLT1_PTD5
#undef FTM2_FLT2_PTD6
#undef FTM2_FLT3_PTD7
#undef FTM2_QD_PHA_PTA0
#undef FTM2_QD_PHA_PTA13
#undef FTM2_QD_PHA_PTE5
#undef FTM2_QD_PHB_PTA12
#undef FTM2_QD_PHB_PTC5
#undef FTM2_QD_PHB_PTE4
#undef FTM3_CH0_PTA2
#undef FTM3_CH1_PTA3
#undef FTM3_CH2_PTC6
#undef FTM3_CH3_PTC7
#undef FTM3_CH4_PTD2
#undef FTM3_CH5_PTD3
#undef FTM3_CH6_PTE2
#undef FTM3_CH7_PTE6
#undef FTM3_FLT0_PTE7
#undef FTM3_FLT1_PTB13
#undef FTM3_FLT2_PTB12
#undef FTM3_FLT3_PTD4
#undef FTM4_CH5_PTB1
#undef FTM4_CH6_PTB0
#undef FTM5_CH0_PTC9
#undef FTM5_CH1_PTC8
#undef FTM5_CH3_PTA7
#undef FTM5_CH5_PTA6
#undef LPSPI2_PCS0_PTC14
#undef LPSPI2_PCS0_PTE11
#undef LPSPI2_PCS1_PTE10
#undef LPSPI2_SCK_PTC15
#undef LPSPI2_SIN_PTC0
#undef LPSPI2_SOUT_PTC1
#undef LPUART2_CTS_PTE9
#undef LPUART2_RTS_PTE3
#undef LPUART2_RX_PTD6
#undef LPUART2_TX_PTD7
#undef noetm_TRACE_SWO_PTA10

#endif /* _ZEPHYR_DTS_BINDING_S32K118_LQFP64_WRAPPER_ */
